static2/mid/system/getCoreMomentum
// -*- C++ -*-
#include "./system/geomCalcs"

fields  (p rho U);

type            sets;
libs            ("libsampling.so");

executeControl     writeTime;
writeControl    writeTime;
interpolationScheme     cellPoint;
setFormat   raw;


sets
(
    line0
    {
        type    lineUniform; // lineCell, lineCellFace
        axis    xyz;    // x, y, z, xyz
        start (0 0 0);
        end   ($x3 0 0);
        nPoints 1000;
    }

    line1
    {
        type    lineUniform; // lineCell, lineCellFace
        axis    xyz;    // x, y, z, xyz
        start (0 0 $z0);
        end   ($x9 0 $z0);
        nPoints 1000;
    }
);

// ************************************************************************* //
